armade/contiki_sam4s/platform/pd9520/Hardware_control/hwcontrol_9520.c
/*
 * hwcontrol_9520.c
 *
 * TODO for COPP:
 *  Definer ENTER/EXIT
 *  Definer delay_microseconds(unsigned us) og delay_nanoseconds(unsigned ns)
 *
 *
 *
 *
 */

/*

Serietermineringer i USB fjernes (det virker ikke med dem i)

spgen-spændingsdeleren har en 10k i bunden i den ene side.
Det skal være 10k/10k til de 47 ohm, og 1k/1k til stel.
Ellers virker ADC ikke.

Lightlink sender opamp har inputben vendt forkert for begge kanaler.
Det skal vendes rigtigt for at det virker.

TIC kondensator skal være 4.7nF NP0, ikke 1nF

Fremtidig: buffer opamp LMC6482 på TIMING signal, værdi...
Isrc er 10mA. Med 1n er det 10V/us.
Da Vmax er ca. 2V, fullscale tid 1us, skal den vaere 5nF. 4.7nF.
Ileak 1uA i 4.7nF er 200V/s, 0.2mV/us
det er ok..



Floating Generator, fremtidig version:
Det er kun lige at opampen i float generatoren kan drive fetten.
Tilføj en -5V chargepump, og forsyn opampens negative side derfra.
Check hvad der sker mht. adc input!!

MUX, fremtidig version:
MUX23 signalet, lige ved siden af I/O22 signalet, bindes ikke til GND,
men i stedet til SPGEN.
Det vil tillade selvtest af FASTIN uden at signalet også ses på et I/O.


*/

#include <stdio.h>
#include <stdint.h>
#include <string.h>
#include "contiki.h"
#include "platform-conf.h"
#include "same70.h"
//#include "at25flash.h"
#include "hwcontrol_9520.h"
#include "SPI1.h"

#include "gpio.h"
#include "pio_handler.h"



unsigned critical_enter(void)
{
	unsigned old = __get_PRIMASK();

	if(!old)
		__set_PRIMASK(1);

	return old;
}

void critical_leave(unsigned old)
{
	if(!old)
		__set_PRIMASK(0);
}


 #define ENTER unsigned saveflag = critical_enter();
 #define EXIT critical_leave(saveflag);




void delay_nanoseconds(unsigned ns)
{
	volatile unsigned time;
	
	time = ns/3;
	
	if(time == 0)
		time = 1;
	
	while(time--)
		asm volatile("NOP");
}
 
/*void delay_microseconds(unsigned us)
{
	delay_nanoseconds(300*us);
}*/

				   


/*const
Pin tcxo_pins[ 3]= {  { 1<<3  , PIOA, ID_PIOA, PIO_PERIPH_A , PIO_DEFAULT}, //TWD0
				      { 1<<4  , PIOA, ID_PIOA, PIO_PERIPH_A , PIO_DEFAULT}, //TWCK0
				      { 1<<5  , PIOC, ID_PIOC, PIO_PERIPH_B , PIO_DEFAULT}}; //PPS TIOA1
*/
#define multiplexer_pins_base PIOC
const unsigned multiplexer_pins[] = {
		PIO_PC16,
		PIO_PC15,
		PIO_PC14,
		PIO_PC13,
		PIO_PC12,
		PIO_PC22,
		PIO_PC21,
		PIO_PC20,
		PIO_PC19,
		PIO_PC18,
		PIO_PC17
};
/*const
Pin multiplexer_pins[11]= {  { 1<<16 , PIOC, ID_PIOC, PIO_OUTPUT_0 , PIO_DEFAULT}, //enable 1
						     { 1<<15 , PIOC, ID_PIOC, PIO_OUTPUT_0 , PIO_DEFAULT}, //enable 2
						     { 1<<14 , PIOC, ID_PIOC, PIO_OUTPUT_0 , PIO_DEFAULT}, //enable 3
						     { 1<<13 , PIOC, ID_PIOC, PIO_OUTPUT_0 , PIO_DEFAULT}, //enable 4
						     { 1<<12 , PIOC, ID_PIOC, PIO_OUTPUT_0 , PIO_DEFAULT}, //enable 5
						     { 1<<22 , PIOC, ID_PIOC, PIO_OUTPUT_0 , PIO_DEFAULT}, //a0
						     { 1<<21 , PIOC, ID_PIOC, PIO_OUTPUT_0 , PIO_DEFAULT}, //a1
						     { 1<<20 , PIOC, ID_PIOC, PIO_OUTPUT_0 , PIO_DEFAULT}, //a2
						     { 1<<19 , PIOC, ID_PIOC, PIO_OUTPUT_0 , PIO_DEFAULT}, //a3
						     { 1<<18 , PIOC, ID_PIOC, PIO_OUTPUT_0 , PIO_DEFAULT},  //a4
						     { 1<<17 , PIOC, ID_PIOC, PIO_OUTPUT_0 , PIO_DEFAULT} }; //a5
						     */
/*const
Pin programmer_pins[6]= { { 1<<0  , PIOC, ID_PIOC, PIO_INPUT , PIO_PULLUP},
                          { 1<<1  , PIOC, ID_PIOC, PIO_INPUT , PIO_PULLUP},
                          { 1<<2  , PIOC, ID_PIOC, PIO_INPUT , PIO_PULLUP},
                          { 1<<3  , PIOC, ID_PIOC, PIO_INPUT , PIO_PULLUP},
                          { 1<<4  , PIOC, ID_PIOC, PIO_INPUT , PIO_PULLUP},
                          { 1<<19 , PIOD, ID_PIOD, PIO_OUTPUT_0 , PIO_DEFAULT} };

*/

#define SPI3_MISO_BIT 23
#define SPI3_MOSI_BIT 24
#define SPI3_SCK_BIT 25
#define SPI3_CS1_BIT 26
#define SPI3_CS2_BIT 28
#define SPI3_CS3_BIT 29
#define SPI3PORT PIOD
/*static Pin spi3[6]={ { 1<<SPI3_MISO_BIT , PIOD, ID_PIOD, PIO_INPUT   , PIO_DEFAULT},
                     { 1<<SPI3_MOSI_BIT , PIOD, ID_PIOD, PIO_OUTPUT_1, PIO_DEFAULT},
                     { 1<<SPI3_SCK_BIT , PIOD, ID_PIOD, PIO_OUTPUT_1, PIO_DEFAULT},
                     { 1<<SPI3_CS1_BIT , PIOD, ID_PIOD, PIO_OUTPUT_1, PIO_DEFAULT},
                     { 1<<SPI3_CS2_BIT , PIOD, ID_PIOD, PIO_OUTPUT_1, PIO_DEFAULT},
                     { 1<<SPI3_CS3_BIT , PIOD, ID_PIOD, PIO_OUTPUT_1, PIO_DEFAULT} };*/


//////////////////////////////////////////////////////////////////////////
/////////   SPI 1 lowlevel  //////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////

static unsigned char spi1_selected;
volatile unsigned spi1_currentmuxmask;



void spi1_delay(void)
{
	delay_nanoseconds(1000);
}

void spi1_unselect(void)
{
	if (spi1_selected) {
		SPI1_select(none);
		spi1_selected=0;
		//spi1_delay(); //idle
	}
}

void spi1_select_adc(void) //ud paa falling edge, ind paa rising edge,
{
	//SPI1_select(none);
	SPI1_select(ADC);
	//spi1_delay();
	spi1_selected=4;
}

void spi1_dac24(unsigned d)
{
	//unsigned bit;
	unsigned char d_uint[3];
	
	d_uint[0] = d>>16;
	d_uint[1] = d>>8;
	d_uint[2] = d>>0;
	
	//SPI1_select(none);
	SPI1_select(DAC);
	spi1_selected=5;
	//spi1_delay();
	SPI1_write_buffer_wait(d_uint,3);
	/*for (bit=0; bit<24; ++bit) {  //observeret: 10MHz data rate = 15 bus cycles, det er 2x antal eksplicitte ops.
		//data setup
		if (d&0x800000)
			SPI1PORT->PIO_SODR = 1<<SPI1_MOSI_BIT;
		else
			SPI1PORT->PIO_CODR = 1<<SPI1_MOSI_BIT;
		d<<=1;
		spi1_delay();
		//falling edge
		SPI1PORT->PIO_CODR = 1<<SPI1_SCK_BIT; //4 busops = 27ns
		spi1_delay();
		//rising edge
		SPI1PORT->PIO_SODR = 1<<SPI1_SCK_BIT; //3 busops = 20ns
	}*/
	//spi1_delay();
	SPI1_select(none);
	spi1_selected=0;
	//spi1_delay();
}


void spi1_muxmask(unsigned d)
{
	//unsigned bit;
	unsigned char d_uint[3];
	spi1_currentmuxmask=d;
	//SPI1_select(none);
	SPI1_select(MUX);
	spi1_selected=6;
	//spi1_delay();
	
	d_uint[0] = d>>8;
	d_uint[1] = d>>0;
	
	SPI1_write_buffer_wait(d_uint,2);
	/*for (bit=0; bit<16; ++bit) {
		//data setup
		if (d&0x8000)
			SPI1PORT->PIO_SODR = 1<<SPI1_MOSI_BIT;
		else
			SPI1PORT->PIO_CODR = 1<<SPI1_MOSI_BIT;
		d<<=1;
		//falling edge
		SPI1PORT->PIO_CODR = 1<<SPI1_SCK_BIT;
		spi1_delay();
		//rising edge
		SPI1PORT->PIO_SODR = 1<<SPI1_SCK_BIT;
		spi1_delay();
	}*/
	SPI1_select(none);
	spi1_selected=0;
	//spi1_delay();
}

unsigned spi1_adcx_int(unsigned d, unsigned n)
{
	unsigned out=0;
	uint8_t result=0;
	int bits_signed = n;
	
	if(!(n == 32 || n == 24 || n == 16 || n == 8))
		return -1;

	do{
		out<<=8;
		SPI1_read_buffer_wait(&result, 1,	(d>>(bits_signed-8))&0xff);
		out |= result;
		bits_signed-=8;
	}while(bits_signed);
	
	
