armade/contiki_sam4s/platform/pd9520/Hardware_control/hwcontrol_9520.c
	/*while (n) {
		--n;
		if (d&(1<<n))
			SPI1PORT->PIO_SODR = 1<<SPI1_MOSI_BIT;
		else
			SPI1PORT->PIO_CODR = 1<<SPI1_MOSI_BIT;
		SPI1PORT->PIO_CODR = 1<<SPI1_SCK_BIT;
		spi1_delay();
		//sample before rising edge
		if (SPI1PORT->PIO_PDSR&(1<<SPI1_MISO_BIT)) out|=1<<n;
		SPI1PORT->PIO_SODR = 1<<SPI1_SCK_BIT;
		spi1_delay();
	}*/
	return out;
}

//////////////////////////////////////////////////////////////////////////
/////////   SPI 3 lowlevel  //////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////

extern unsigned char spi3_selected;



void spi3_select_adc(void) //ud paa falling edge, ind paa rising edge,
{
	spi3_unselect();
	SPI3PORT->PIO_CODR = 1<<SPI3_CS2_BIT;
	spi3_delay();
	spi3_selected=2;
}


void spi3_dac24(unsigned d)
{
	unsigned bit;
	//dac er hurtig, men speciel: Data ind paa falling edge.
	//1 busoperation er 6.6ns.

	spi3_unselect();
	SPI3PORT->PIO_CODR = 1<<SPI3_CS3_BIT;
	spi3_selected=3;

	for (bit=0; bit<24; ++bit) {  //observeret: 10MHz data rate = 15 bus cycles, det er 2x antal eksplicitte ops.
		//data setup
		if (d&0x800000)
			SPI3PORT->PIO_SODR = 1<<SPI3_MOSI_BIT;
		else
			SPI3PORT->PIO_CODR = 1<<SPI3_MOSI_BIT;
		d<<=1;
		SPI3PORT->PIO_CODR=0;
		SPI3PORT->PIO_CODR=0;

		//falling edge
		SPI3PORT->PIO_CODR = 1<<SPI3_SCK_BIT; //4 busops = 27ns
		SPI3PORT->PIO_CODR=0;
		SPI3PORT->PIO_CODR=0;
		//rising edge
		SPI3PORT->PIO_SODR = 1<<SPI3_SCK_BIT; //3 busops = 20ns
	}
	SPI3PORT->PIO_CODR=0; //tail
	SPI3PORT->PIO_CODR=0;
	SPI3PORT->PIO_SODR = (1<<SPI3_CS1_BIT)|(1<<SPI3_CS2_BIT)|(1<<SPI3_CS3_BIT);
	SPI3PORT->PIO_CODR=0; //tail
	SPI3PORT->PIO_CODR=0;
	spi3_selected=0;
}

unsigned spi3_adcx_int(unsigned d, unsigned n)
{
	unsigned out=0;
	while (n) {
		--n;
		if (d&(1<<n))
			SPI3PORT->PIO_SODR = 1<<SPI3_MOSI_BIT;
		else
			SPI3PORT->PIO_CODR = 1<<SPI3_MOSI_BIT;
		SPI3PORT->PIO_CODR = 1<<SPI3_SCK_BIT;
		spi3_delay();
		//sample before rising edge
		if (SPI3PORT->PIO_PDSR&(1<<SPI3_MISO_BIT)) out|=1<<n;
		SPI3PORT->PIO_SODR = 1<<SPI3_SCK_BIT;
		spi3_delay();
	}
	return out;
}



//////////////////////////////////////////////////////////////////////////
/////////   abstraktioner   //////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////

void lowdac_cmd(unsigned cmd)
{
	ENTER
	spi3_dac24(cmd); //inkluderer chipselect
	EXIT
}

void lowdac_set(unsigned chan, unsigned val)
{
	ENTER
	spi3_dac24((3<<19) | ((chan&7)<<16) | (val&0xFFFF) ); //write and update - inkluderer chipselect
	EXIT
}

void psu_off(void)
{
	ENTER
	pio_clear(PIOC, PIO_PC31);
	//PIO_Clear(&psu_enable_pin);
	lowdac_set(3, 65535); //Vgen DAC max off
	EXIT
}

void psu_on_dac(unsigned outval) //slew rate pos = 60V/ms = 3,96A
{
	ENTER
	lowdac_set(3, 65535-outval); //vender om.
	//PIO_Set(&psu_enable_pin);
	pio_set(PIOC, PIO_PC31);
	EXIT
}

void gen20mA_off(void)
{
	ENTER
	pio_set(PIOB, PIO_PB4);//PIO_Set(&curgen20_disable_pin);
	lowdac_set(2, 0);
	EXIT
}

void gen20mA_on_dac(unsigned dac)
{
	ENTER
	pio_clear(PIOB, PIO_PB4);//PIO_Clear(&curgen20_disable_pin);
	lowdac_set(2, dac);
	EXIT
}
unsigned Current_DAC_position;
void spgen_set_dac(unsigned dac)
{
	ENTER
	Current_DAC_position = dac;
	lowdac_set(1, dac);
	EXIT
}

void fastin_dac(unsigned dac)
{
	ENTER
	lowdac_set(0, dac);
	EXIT
}

void muxadc_write(unsigned rs, unsigned w, int bit)
{
	ENTER
	spi3_select_adc();
	spi3_adcx_int(  rs<<3 ,8);
	spi3_adcx_int(w,bit);
	spi3_unselect();
	EXIT
}

unsigned muxadc_read(unsigned rs, int bit)
{
	unsigned r;
	ENTER
	spi3_select_adc();
	spi3_adcx_int(  (rs<<3) |0x40 ,8);
	r=spi3_adcx_int(0,bit);
	spi3_unselect();
	EXIT
	return r;
}

unsigned muxadc_status(void)
{
	return muxadc_read(0,8);
}

unsigned muxadc_datau(void)
{
	return muxadc_read(3,24);
}

signed muxadc_datas(void)
{
	return muxadc_read(3,24) - 0x800000;
}



void isodac_cmd(unsigned cmd)
{
	ENTER
	spi1_dac24(cmd); //inkluderer chipselect
	EXIT
}

void isodac_set(unsigned chan, unsigned val)
{
	ENTER
	spi1_dac24((3<<19) | ((chan&7)<<16) | (val&0xFFFF) ); //write and update - inkluderer chipselect
	EXIT
}

void highside_set_dac(int iosignal, int dac) // +/- 65535 ved at kombinere to dacs
{
	unsigned m;
	if ((iosignal>=1)||(iosignal<=16)) {
		//connect generator - nr. 15 er intern selvtest
		m=1<<(iosignal-1);
		ENTER
		if (m!=spi1_currentmuxmask) spi1_muxmask(m);
		isodac_set(0, (65535+dac) >>1  ); //neg input paa opamp
		isodac_set(1, (65535-dac) >>1  ); //pos input paa opamp
		//-1    32767 32768
		// 0    32767 32767
		// 1    32768 32767
		// 2    32768 32766
		EXIT
		return;
	}
	//turn off generator
	ENTER
	isodac_set(0,     0); //neg input paa opamp
	isodac_set(1, 65535); //pos input paa opamp
	spi1_muxmask(0); //disconnect
	EXIT
}

void highside_off(void)
{
	highside_set_dac(16,-65000);
}

void isoadc_write(unsigned rs, unsigned w, int bit)
{
	ENTER
	spi1_select_adc();
	spi1_adcx_int(  rs<<3 ,8);
	spi1_adcx_int(w,bit);
	spi1_unselect();
	EXIT
}

unsigned isoadc_read(unsigned rs, int bit)
{
	unsigned r;
	ENTER
	spi1_select_adc();
	spi1_adcx_int(  (rs<<3) |0x40 ,8);
	r=spi1_adcx_int(0,bit);
	spi1_unselect();
	EXIT
	return r;
}

unsigned isoadc_status(void)
{
	return isoadc_read(0,8);
}

unsigned isoadc_datau(void)
{
	return isoadc_read(3,24);
}

signed isoadc_datas(void)
{
	return isoadc_read(3,24) - 0x800000;
}

//////////////////////////////////////////////////////////////////////////
///////////  multiplexer kontrol lowside /////////////////////////////////
//////////////////////////////////////////////////////////////////////////

static unsigned char multiplexer_a_current_selection;
static unsigned char multiplexer_b_current_selection;

static inline void myPIO_PutBit(unsigned pin, unsigned b)
{
	b ?	(pio_set(multiplexer_pins_base,pin)) : (pio_clear(multiplexer_pins_base,pin));
}

void multiplexer_a_select_int(int iosignal) //den brede mux
{
	int i;

	//anti blafre logik
	if (iosignal==multiplexer_a_current_selection) return;
	ENTER
	multiplexer_a_current_selection=iosignal;

	//konverter for normale signaler
	i=iosignal-1;
	if (i>=15) ++i; //iosignal16 er skubbet 1 opad
	//og for specielle signaler
	if ((iosignal<1)||(iosignal>22)) i=24; //tristate for alle ugyldige vaerdier, undtagen:
	if (iosignal==108) i=15; //internal gnd 1
	if (iosignal==109) i=23; //internal gnd 2 - fremtidigt noget andet for bedre selvtest

	//disable
	//pio_set
	pio_clear(multiplexer_pins_base,multiplexer_pins[0]); //PIO_Clear(multiplexer_pins+0);
	pio_clear(multiplexer_pins_base,multiplexer_pins[1]); //PIO_Clear(multiplexer_pins+1);
	pio_clear(multiplexer_pins_base,multiplexer_pins[2]); //PIO_Clear(multiplexer_pins+2);
	pio_get(multiplexer_pins_base,PIO_OUTPUT_1,multiplexer_pins[2]); //PIO_Get(multiplexer_pins+2); //sync
	delay_nanoseconds(350);
	//configure
	myPIO_PutBit(multiplexer_pins[5], i&1);
	myPIO_PutBit(multiplexer_pins[6], i&2);
	myPIO_PutBit(multiplexer_pins[7], i&4);
	pio_get(multiplexer_pins_base,PIO_OUTPUT_1,multiplexer_pins[2]); //PIO_Get(multiplexer_pins+2); //sync
	delay_nanoseconds(350);
	//reenable
	if (i<8) pio_set(multiplexer_pins_base,multiplexer_pins[0]);
	else
		if (i<16) pio_set(multiplexer_pins_base,multiplexer_pins[1]);
		else
			if (i<24) pio_set(multiplexer_pins_base,multiplexer_pins[2]);
	EXIT
}

void multiplexer_a_select(int iosignal) //den brede mux
{
	unsigned b = multiplexer_b_current_selection;
	if ((b==103)||(b==104)||(b==105))  //farligt signal er valgt på den anden multiplekser
		if (iosignal)                  //og dette bliver farligt..
			multiplexer_b_off();       //anti-braende-af.

	multiplexer_a_select_int(iosignal);
}

