armade/contiki_sam4s/platform/pd9520/Hardware_control/hwcontrol_9520.c
void multiplexer_a_off(void)
{
	multiplexer_a_select_int(0);
}

void multiplexer_a_select_gnd(void)
{
	multiplexer_a_select(108);
}

void multiplexer_b_select_int(int iosignal) //den smalle mux
{
	int i;

	//anti blafre logik
	if (iosignal==multiplexer_b_current_selection) return;

	ENTER
	multiplexer_b_current_selection=iosignal;

	//konverter for normale signaler
	i=iosignal-1;
	if ((iosignal<1)||(iosignal>8)) i=16; //tristate for alle ugyldige vaerdier, undtagen:
	if ((iosignal>=100)&&(iosignal<=107)) { //signalnumre 100..107 er interne generatorer
		i=iosignal-100;
		i+=8;
	}

	//disable
	pio_clear(multiplexer_pins_base,multiplexer_pins[3]); //PIO_Clear(multiplexer_pins+3);
	pio_clear(multiplexer_pins_base,multiplexer_pins[4]); //PIO_Clear(multiplexer_pins+4);
	pio_get(multiplexer_pins_base,PIO_OUTPUT_1,multiplexer_pins[4]); //PIO_Get(multiplexer_pins+4); //sync
	delay_nanoseconds(350);
	//configure
	myPIO_PutBit(multiplexer_pins[8], i&1);
	myPIO_PutBit(multiplexer_pins[9], i&2);
	myPIO_PutBit(multiplexer_pins[10], i&4);
	pio_get(multiplexer_pins_base,PIO_OUTPUT_1,multiplexer_pins[2]); //PIO_Get(multiplexer_pins+2); //sync
	delay_nanoseconds(350);
	//reenable
	if (i<8) pio_set(multiplexer_pins_base,multiplexer_pins[4]); //enable5: den med IO 1..8
	else
		if (i<16) pio_set(multiplexer_pins_base,multiplexer_pins[3]); //enable4: interne signaler
	EXIT
}


void multiplexer_ab_select_levelselftest_io1(void) //very special...
{
	int i;

	ENTER
	multiplexer_b_current_selection=80; //80 er et internt ID for denne mode.
	//special:
	//  konfigurer til signal 0 (fastinput) samtidig med IO1 på B mux
	i=0;
	//disable
	pio_clear(multiplexer_pins_base,multiplexer_pins[3]); //PIO_Clear(multiplexer_pins+3);
	pio_clear(multiplexer_pins_base,multiplexer_pins[4]); //PIO_Clear(multiplexer_pins+4);
	pio_get(multiplexer_pins_base,PIO_OUTPUT_1,multiplexer_pins[4]); //PIO_Get(multiplexer_pins+4); //sync
	delay_nanoseconds(350);
	//configure
	myPIO_PutBit(multiplexer_pins[8], i&1);
	myPIO_PutBit(multiplexer_pins[9], i&2);
	myPIO_PutBit(multiplexer_pins[10], i&4);
	pio_get(multiplexer_pins_base,PIO_OUTPUT_1,multiplexer_pins[2]); //PIO_Get(multiplexer_pins+4); //sync
	delay_nanoseconds(350);
	//reenable BEGGE multiplexere
	pio_set(multiplexer_pins_base,multiplexer_pins[4]); //enable5: den med IO 1..8
	pio_set(multiplexer_pins_base,multiplexer_pins[3]); //enable4: interne signaler
	EXIT
	//vi har nu SPGEN ud paa IO1, og FASTIN på COMMON
	multiplexer_a_select(1); // IO1 (SPGEN) på common.
}




void multiplexer_b_select(int iosignal) //den smalle mux
{
	if (iosignal>8) iosignal=0;
	multiplexer_b_select_int(iosignal);
}

void multiplexer_b_select_fastin(void)
{
	multiplexer_b_select_int(100);
}
void multiplexer_b_select_spgen(void)
{
	multiplexer_b_select_int(101);
}
void multiplexer_b_select_pulsgen(void)
{
	multiplexer_b_select_int(102);
}
void multiplexer_b_select_gnd(void)
{
	if (multiplexer_a_current_selection) multiplexer_a_off(); //anti-braende-af.
	multiplexer_b_select_int(103);
}
void multiplexer_b_select_psu_hard(void)
{
	if (multiplexer_a_current_selection) multiplexer_a_off(); //anti-braende-af.
	multiplexer_b_select_int(105);
}
void multiplexer_b_select_psu_6k81(void)
{
	multiplexer_b_select_int(106);
}
void multiplexer_b_select_gnd_6k81(void)
{
	multiplexer_b_select_int(107);
}

void multiplexer_b_off(void)
{
	multiplexer_b_select_int(0);
}



void init_9520(int mck)
{
	uint8_t i;

    //spi3_init();
    //spi1_init();
	//PIO_Configure( &psu_enable_pin, 1 ) ;
	pio_configure(PIOC, PIO_OUTPUT_0,PIO_PC31, 0);
	MATRIX->CCFG_SYSIO |= 1<<4; //enable PB4, no TDI  //KKP 20160222
	//PIO_Configure( &curgen20_disable_pin, 1 ) ;
	pio_configure(PIOB, PIO_OUTPUT_1,PIO_PB4, 0);
	delay_microseconds(5);
	spi3_dac24(0x280001); //power on reset
	spi1_dac24(0x280001); //power on reset
	//medens dac'er arbejder kan vi lige resette adc'en
	spi3_select_adc();
	spi3_adcx_int(0xFFFFFFFFU,32); //reset
	spi3_unselect();
	spi1_select_adc();
	spi1_adcx_int(0xFFFFFFFFU,32); //reset
	spi1_unselect();
	//og tilbage til dac'erne
	delay_microseconds(100);
	spi3_dac24(0x20000F); //power down register, all channels active
	spi1_dac24(0x20000F); //power down register, all channels active
	delay_microseconds(100);
	spi3_dac24(0x380001); //reference on
	spi1_dac24(0x380001); //reference on
	delay_microseconds(400); //vi skal bruge mindst 500 til ADC'en, så her er god tid.
	lowdac_set(0, 13107); //comparator threshold 5V = 0,5V DAC = 0.2V
	lowdac_set(1, 20047); //Vstim DAC = 10V = 0.778V  =20047
	lowdac_set(2,     0); //Cur DAC = 0mA
	lowdac_set(3, 65536); //Vgen DAC max off
	isodac_set(0,     0); //neg input paa opamp
	isodac_set(1, 65535); //pos input paa opamp
	isodac_set(2, 32768); //unused
	isodac_set(3, 32768); //unused

	//multiplexer initialiseres til off
	//PIO_Configure( multiplexer_pins, 11 ) ;

	for(i=0; i< sizeof(multiplexer_pins)/sizeof(int);i++)
		pio_configure(multiplexer_pins_base, PIO_OUTPUT_1,multiplexer_pins[i], 0);



	multiplexer_a_current_selection=255;
	multiplexer_b_current_selection=255;
	//og den paa iso siden ogsaa
	spi1_muxmask(0);



	//TCXO, XIN32=PA7 TIOA6=PC5 - Dette giver en 2048Hz capture rate med 9155.273 counterticks/capture - og vi kan interrupte pr 2.
	//PMC_EnablePeripheral(ID_TC2); //TIOA6
	pmc_enable_periph_clk(ID_TC2);
	TC2->TC_CHANNEL[0].TC_CCR =  TC_CCR_CLKDIS;
	TC2->TC_CHANNEL[0].TC_IDR =  0xFFFFFFFF;
	TC2->TC_CHANNEL[0].TC_SR;
	TC2->TC_CHANNEL[0].TC_CMR = 1 | TC_CMR_LDRA_RISING | TC_CMR_LDRB_RISING | TC_CMR_SBSMPLR_SIXTEENTH ; //E70:1=mck div 8 capture mode, TIOA6 rising /16
	TC2->TC_CHANNEL[0].TC_CCR = TC_CCR_CLKEN | TC_CCR_SWTRG;
	//PIO_Configure( tcxo_pins, 3 );
	
	//init_RTC();
	
/*	//pe4 TIMEROUT TIOB10 - virker ikke, skal fixes - og det skal ikke vaere her.
	PMC_EnablePeripheral(ID_TC3); //TIOA9..11
	TC3->TC_CHANNEL[1].TC_CCR =  TC_CCR_CLKDIS;
	TC3->TC_CHANNEL[1].TC_IDR =  0xFFFFFFFF;
	TC3->TC_CHANNEL[1].TC_SR;      //18.75MHz, 1875 for 10kHz
	TC3->TC_CHANNEL[1].TC_RC=1875;
	TC3->TC_CHANNEL[1].TC_RB=1875/2;
	TC3->TC_CHANNEL[1].TC_CMR = 1 | TC_CMR_WAVE | TC_CMR_WAVSEL_UP_RC | TC_CMR_BCPB_SET | TC_CMR_BCPC_CLEAR;
	TC3->TC_CHANNEL[1].TC_CCR = TC_CCR_CLKEN | TC_CCR_SWTRG;
	PIO_Configure( &pulsgen_pin, 1 ) ;*/


