armade/contiki_sam4s/platform/pd9520/Hardware_control/hwcontrol_9520.c
	//tilbage til ADC init. Der er gået 600 us.
	//Start referencen - brug intern AVCC maaling som init. 16ms maaletid.
	isoadc_write( 2, (2<<6) |8, 16 ); //internal ref no buf, null
	isoadc_write( 1, 0x2003, 16 ); //single conversion, 16Hz, 50Hz reject
	muxadc_write( 2, (2<<6) | (1<<4) |8, 16 ); //internal ref, buffered, null
	muxadc_write( 1, 0x2003, 16 ); //single conversion, 16Hz, 50Hz reject
	do {} while (isoadc_status()&128);
	do {} while (muxadc_status()&128);
	muxadc_datau();
	isoadc_datau();
	//referencen er startet, DAC'erne har fået spænding på deres referencekondensatorer,
	//og alt forventes at være faldet til ro.

	//highside i alm-off tilstand.
	highside_off();
	multiplexer_b_off();
	multiplexer_a_off();



	static float PSU_setpoint = 5;
	Set_PSU_voltage_V(PSU_setpoint);


	//PIO_Configure( programmer_pins, 6 ) ;
}

selftestdata_t selftestdata;

static int i_selftest_iso_igen_read(unsigned ch)
{
	isoadc_write( 2, (2<<6) | ch, 16 ); //internal ref no buf, opamp voltage
	isoadc_write( 1, 0x2004, 16 ); //single conversion, fast
	do {delay_microseconds(10);} while (isoadc_status()&128);
	return isoadc_datas();
}

int isogen_selftest(void)
{
	int u1,u2,u3,u4;

	////////////step 1: zero
	highside_off();
	delay_microseconds(10000);
	isoadc_write( 2, (2<<6) | (1<<4) |7|(1<<12), 16 ); //internal ref, buffered, avdd monitor, unipolar
	isoadc_write( 1, 0x2004, 16 ); //single conversion, fast
	do {delay_microseconds(10);} while (isoadc_status()&128);
	u1=isoadc_datau() / 2390; //AVCC: 2389916 counts pr volt, u er millivolt VCC
	u2=i_selftest_iso_igen_read(2) /1247;   //1246913 cts pr volt, u er millivolt OpAmp
	u3=i_selftest_iso_igen_read(0) /716;   //716975 cts/A
	selftestdata.isogen_data[0]=u1;
	selftestdata.isogen_data[1]=u2;
	selftestdata.isogen_data[2]=u3;
	//test AVCC
	if (u1<4500) return -1;
	if (u1>5500) return -2;
	//opamp skal vaere hoej/disabled
	if (u2<3400) return -3; //
	if (u2>5500) return -4; //umulighed.
	//shunt skal vaere stroemloes
	if (u3<-2) return -5; //
	if (u3> 2) return -6; // eq. 20mA fejl

	/////////////step 2: 372mA og FET test
	highside_set_dac(16,20000); //nominelt 372 mA
	delay_microseconds(10000);
	isoadc_write( 2, (2<<6) | (1<<4) |7|(1<<12), 16 ); //internal ref, buffered, avdd monitor, unipolar
	isoadc_write( 1, 0x2004, 16 ); //single conversion, fast
	do {delay_microseconds(10);} while (isoadc_status()&128);
	u1=isoadc_datau() / 2390; //AVCC: 2389916 counts pr volt, u er millivolt VCC
	u2=i_selftest_iso_igen_read(2) /1247;   //1246913 cts pr volt, u er millivolt OpAmp
	u3=i_selftest_iso_igen_read(0) /716;   //716975 cts/A
	spi1_muxmask(0);
	u4=i_selftest_iso_igen_read(0) /716;   //716975 cts/A
	highside_off();
	selftestdata.isogen_data[3]=u1;
	selftestdata.isogen_data[4]=u2;
	selftestdata.isogen_data[5]=u3;
	selftestdata.isogen_data[6]=u4;
	//test AVCC
	if (u1<4300) return -7;
	if (u1>5500) return -8;
	//opamp maa ikke vaere saturated
	if (u2<400) return -9; //
	//shunt skal vaere 372 mA +/- tolerancen, 10% for test, og 4mA mere for offset
	if (u3<330) return -10; //
	if (u3>413) return -11; //
	//test fet kontrol: med det slukket skal stroemmen falde (til 0 faktisk, men 50 er en ok testgraense)
	if (u4>50) return -12; //

	/////////////step 3: 1A
	highside_set_dac(16,53739); //nominelt 1A
	delay_microseconds(10000);
	isoadc_write( 2, (2<<6) | (1<<4) |7|(1<<12), 16 ); //internal ref, buffered, avdd monitor, unipolar
	isoadc_write( 1, 0x2004, 16 ); //single conversion, fast
	do {delay_microseconds(10);} while (isoadc_status()&128);
	u1=isoadc_datau() / 2390; //AVCC: 2389916 counts pr volt, u er millivolt VCC
	u2=i_selftest_iso_igen_read(2) /1247;   //1246913 cts pr volt, u er millivolt OpAmp
	u3=i_selftest_iso_igen_read(0) /716;   //716975 cts/A
	highside_off();
	selftestdata.isogen_data[7]=u1;
	selftestdata.isogen_data[8]=u2;
	selftestdata.isogen_data[9]=u3;
	//test AVCC
	if (u1<4300) return -13;
	if (u1>5500) return -14;
	//opamp maa ikke vaere saturated
	if (u2<400) return -15; //saturated
	if (u2>3500) return -16; //umulig hoej gatespaending
	//shunt skal vaere 1000 mA +/- tolerancen, 10% for test
	if (u3<900) return -17; //
	if (u3>1100) return -18; //

	////////////step 4: recovery fra off
	highside_set_dac(16,-60000); 
	delay_microseconds(10000);
	highside_set_dac(16,20000); //nominelt 372 mA
	u1=i_selftest_iso_igen_read(0);   //716975 cts/A
	u2=i_selftest_iso_igen_read(0);   //716975 cts/A
	u3=i_selftest_iso_igen_read(0);   //716975 cts/A
	highside_off();
	selftestdata.isogen_data[10]=u1;
	selftestdata.isogen_data[11]=u2;
	selftestdata.isogen_data[12]=u3;

	return 0;
}

static int i_gen20mA_read(unsigned ch)
{
	muxadc_write( 2, (2<<6) | ch, 16 ); //internal ref no buf, opamp voltage
	muxadc_write( 1, 0x2009, 16 ); //single conversion, normal speed
	do {delay_microseconds(10);} while (muxadc_status()&128);
	return muxadc_datas();
}

static int i_spgen_read(unsigned ch)
{
	muxadc_write( 2, (2<<6) | ch, 16 ); //internal ref no buf, opamp voltage
	muxadc_write( 1, 0x2004, 16 ); //single conversion, normal speed
	do {delay_microseconds(10);} while (muxadc_status()&128);
	return muxadc_datas();
}

int gen20ma_selftest(void)
{
	signed s1,s2,s3,s4,s5,s6;

	highside_off();
	multiplexer_a_select(0); //none
	spgen_set_dac(0);
	delay_microseconds(1000);

	//multiplexer_b_select_spgen(); --kkp: nuvaerende spgen kan ikke altid drive 20mA
	//spgen_set_dac(16000);
	multiplexer_b_select_psu_hard();
	psu_on_dac(1966* 10); //33.33V span, 1966/V, ca. 10V

	//generator: 1.25V i 40.2 ohm er 31,1mA. 2108 counts per mA
	//adc: 29.1mA FS, 288223 counts per mA
	gen20mA_on_dac(2108 * 4);
	delay_microseconds(10000);
	s1=i_gen20mA_read(0)/288;
	gen20mA_on_dac(2108 * 14);
	delay_microseconds(10000);
	s2=i_gen20mA_read(0)/288;
	gen20mA_on_dac(2108 * 24);
	delay_microseconds(10000);
	s3=i_gen20mA_read(0)/288;
	gen20mA_off();
	delay_microseconds(10000);
	s4=i_gen20mA_read(0)/288;
	selftestdata.gen20mA_data[0]=s1;
	selftestdata.gen20mA_data[1]=s2;
	selftestdata.gen20mA_data[2]=s3;
	selftestdata.gen20mA_data[3]=s4;
	multiplexer_b_select(0);
	psu_off();

	//KKP 20160222
	multiplexer_b_select_spgen(); //obs - kan ikke altid drive 20mA.
	spgen_set_dac(2040* 1); //1V
	delay_microseconds(10000);
	s5=(i_gen20mA_read(0)*968)/279;
	selftestdata.gen20mA_data[6]=i_spgen_read(2)/227;

	spgen_set_dac(2040* 21); //22V
	delay_microseconds(10000);
	s6=(i_gen20mA_read(0)*968)/279;
	selftestdata.gen20mA_data[7]=i_spgen_read(2)/227;

	//med 20V delta skal man se 10uA.
	//s5,s6 er i nA
	selftestdata.gen20mA_data[4]=s5;
	selftestdata.gen20mA_data[5]=s6;
	multiplexer_b_select(0);

	if (s1<3000) return -1;
	if (s1>5000) return -2;
	if (s2<13000) return -3;
	if (s2>15000) return -4;
	if (s3<23000) return -5;
	if (s3>25000) return -6;
	if (s4<-500) return -7;
	if (s4>500) return -8;

	s6-=s5;
	if (s6<9000) return -9;
	if (s6>11000) return -10;

