armade/contiki_sam4s/platform/pd9520/Hardware_control/hwcontrol_9520.c
	return 0;
}


int spgen_selftest(void)
{
	int i,act,e,err;

	highside_off();
	gen20mA_off();
	multiplexer_a_select(0); //none
	delay_microseconds(1000);
	multiplexer_b_select_spgen();

	err=0;
	//ramp test
	//dac: 32.125 span, 2040 cts pr V
	//adc: 31.5 deler, 36.855 span, 227611 cts per volt
	for (i=0; i<32; ++i) {
		spgen_set_dac(2040*i);
		delay_microseconds(1000);
		act=i_spgen_read(2)/227; 
		selftestdata.spgen_data1[i]=act;
		e=act-1000*i;
		if (i<20) {
			if (e<-2000) ++err;
			if (e>2000) ++err;
		}
	}

	//load test. 47 ohm delt med 11, opfoerer sig som 4,7 ohm. Dvs 4,7mV/mA = 30634/mA
	spgen_set_dac(2040 * 8);
	delay_microseconds(10000);
	selftestdata.spgen_data2[0]=i_spgen_read(4)/30;
	for (i=1; i<4; ++i) {
		gen20mA_on_dac(2108 *i *10);     //2108 pr mA, 10mA step
		delay_microseconds(10000);
		selftestdata.spgen_data2[i]=i_spgen_read(4)/30;

	}
	gen20mA_off();
	//cmrr test
	spgen_set_dac(2040 * 4);
	delay_microseconds(10000);
	selftestdata.spgen_data2[4]=i_spgen_read(4)/30;
	spgen_set_dac(2040 * 24);
	delay_microseconds(10000);
	selftestdata.spgen_data2[5]=i_spgen_read(4)/30;

	//check stroem maaling.
	for (i=0; i<4; ++i) {
		e=selftestdata.spgen_data2[i]-10000*i;
		if (e<-5000) ++err;
		if (e>5000) ++err;
	}
	//CMRR test
	e=selftestdata.spgen_data2[4]-selftestdata.spgen_data2[5];
	if (e<-2000) ++err;
	if (e>2000) ++err;

	spgen_set_dac(0);
	multiplexer_b_select(0);
	if (err) return -1;
	return 0;
}

int psu_selftest(void)
{
	int i,e,err,act1,act2;

	highside_off();
	gen20mA_off();
	multiplexer_a_select(0); //none
	delay_microseconds(1000);
	multiplexer_b_select_psu_hard(); //PSU+ direkte

	psu_on_dac(0);  //24mA, 66uF, 360V/s slewrate
	gen20mA_on_dac(2108 * 24); //4mA load, 13 ohm on, 50mV fejl, det er fint
	delay_microseconds(100000);

	gen20mA_on_dac(2108 * 4); //4mA load, 13 ohm on, 50mV fejl, det er fint
	err=0;
	//adc for multiplexer scanner: 31.5 deler, 36.855 span, 227611 cts per volt
	//adc for PSU sp. maaling: 31 deler, 36,27 span, 231282 cts per volt

	for (i=0; i<32; ++i) {
		psu_on_dac(1966*i); //33.33V span, 1966/V
		delay_microseconds(10000);
		act1=i_spgen_read(2)/227; //maalt via mux
		act2=i_spgen_read(5)/231; //maalt via Vsense
		selftestdata.psu_data1[i]=act1;
		selftestdata.psu_data2[i]=act2;

		if (i<20) {
			e=act1-i*1000;
			if (e<0) e=-e;
			if (e>5000) ++err;

			e=act2-i*1000;
			if (e<0) e=-e;
			if (e>5000) ++err;
		}
	}
	psu_on_dac(0);
	//24mA, 66uF, 360V/s slewrate
	gen20mA_on_dac(2108 * 24);
	delay_microseconds(100000);
	gen20mA_on_dac(2108 * 4); //4mA load, 13 ohm on, 50mV fejl, det er fint
	selftestdata.psu_data1[32]=i_spgen_read(2)/227; //maalt via mux
	selftestdata.psu_data2[32]=i_spgen_read(5)/231; //maalt via Vsense
	gen20mA_off();

	psu_off();
	multiplexer_b_select(0);
	if (err) return -1;
	return 0;
}


int selftest_all(void)
{
	delay_microseconds(1000000); // We need 1 sec settling time before selftest.
	psu_off();
	multiplexer_b_select(0);
	multiplexer_a_select(0);
	selftestdata.isogen=isogen_selftest();
	selftestdata.gen20ma=gen20ma_selftest();
	selftestdata.spgen=spgen_selftest();
	selftestdata.psu=psu_selftest();
	//selftestdata.ethsw=-!ethsw_checkalive(); //-1 ved fejl

	//selftestdata.cpld=initcpld9520();

	if (selftestdata.isogen) return 0;
	if (selftestdata.gen20ma) return 0;
	if (selftestdata.spgen) return 0;
	if (selftestdata.psu) return 0;
	if (selftestdata.ethsw) return 0;
	return 1;
}



/*void print_state(void)
{
	print_loud("state: muxA: %d muxB: %d spi1_mux: %d\n",
	multiplexer_a_current_selection,
	multiplexer_b_current_selection,
	spi1_currentmuxmask);
}*/

////////////////////////////////////////////////////////////////////////

// x*1.17/2^23*31.1 = x*4.338E-6 
// Reading AIN6 on IC09
float Get_PSU_voltage_V(void)
{
	float ret;
	ret = i_gen20mA_read(5);
	ret *= hwio_cal_userpage_internal.multiio_cal.PSU_read_mul;
	ret += hwio_cal_userpage_internal.multiio_cal.PSU_read_zero;
	return ret;
}

void Set_PSU_voltage_V(float voltage_V)
{
	if(voltage_V > 0){
		voltage_V *= hwio_cal_userpage_internal.multiio_cal.PSU_set_mul;
		voltage_V += hwio_cal_userpage_internal.multiio_cal.PSU_set_zero;
		psu_on_dac(voltage_V); //33.33V span, 1966/V
	}
	else{
		psu_off();
	}
}

// Reading AIN2 on IC09
float Get_DUT_current_consumtion_A(void)
{
	float ret;
	ret =  i_gen20mA_read(1);
	ret *= hwio_cal_userpage_internal.multiio_cal.DUT_ana_mul;
	ret += hwio_cal_userpage_internal.multiio_cal.DUT_ana_zero;
	return ret;
}
////////////////////////////////////////////////////////////////////////

void Route_io_to_analog_measurement(int io, int calib)
{
	if(io < 1 || io > 22)
		return;
	
	multiplexer_b_off();
	
	if(!calib) {
		highside_off();
	
		ENTER
		spi1_muxmask(0); //disconnect
		EXIT
	}
	multiplexer_a_select(io);
}

// Reading AIN1 on IC09
int Get_analog_current_A(void)
{
	return i_gen20mA_read(0);
}

// SPI3 - DAC3
void Set_analog_current_A(int current)
{
	gen20mA_on_dac(current);
}
////////////////////////////////////////////////////////////////////////
int Route_io_to_voltage_generator(int io, int calib)
{
	if(!calib)
		highside_off();
	gen20mA_off();
	delay_microseconds(1000);
	multiplexer_b_select_spgen();
	multiplexer_a_select(io);
	
	return 0;
}

int Route_io_to_voltage_generator_through_mux_b(int io, int calib)
{
	if(io < 1 || io > 8)
		return 1;
	
	multiplexer_b_select(io);
	return 0;
}

void Set_analog_voltage_v(int voltage)
{
	spgen_set_dac(voltage);	
}

int Get_analog_voltage(void)
{
	return i_spgen_read(2);//227611.0;
}

int Get_current_in_voltage_generator(void)
{
	return i_spgen_read(4); // 1,17V/2^23 / 47.5ohm
}
////////////////////////////////////////////////////////////////////////
int Get_digital_current(void)
{
	return i_selftest_iso_igen_read(0);   //716975 cts/A
}

int Set_digital_current(int current)
{
	if(current > 65535 || current < 0)
		return 0;
	ENTER
	isodac_set(0, (65535+current) >>1  ); //neg input paa opamp
	isodac_set(1, (65535-current) >>1  ); //pos input paa opamp
	//-1    32767 32768
	// 0    32767 32767
	// 1    32768 32767
	// 2    32768 32766
	EXIT
	return 0;
}

int Route_io_to_digital_current_measure(int io, int calib)
{
	unsigned m;
	multiplexer_b_off();
	multiplexer_a_select(0);
	gen20mA_off();
	if ((io>=1)||(io<=15)) {
		//connect generator - nr. 15 er intern selvtest
		m=1<<(io-1);
		ENTER
		if (m!=spi1_currentmuxmask) spi1_muxmask(m);
		EXIT
		//print_state();
		return 0;
	}
	ENTER
	spi1_muxmask(0); //disconnect
	EXIT
	return 0;
}



int Route_io_to_fast_in(int io, int calib)
{
	if(!calib)
		highside_off();
	gen20mA_off();
	delay_microseconds(1000);
	multiplexer_b_select_fastin();
	multiplexer_a_select(io);
	fastin_dac(1<<15);
	return 0;
}
/////////////////////////////////////////////////////////////////////

/*int Set_tx_light_intensity(int tx1, int tx2, int x3PNET)
{
	if(tx1 > 31)
		tx1 = 31;
	else if(tx1 < 0)
		tx1 = 0;
	
	if(tx2 > 31)
		tx2 = 31;
	else if(tx2 < 0)
		tx2 = 0;
	
	lightlink_setconfig(tx1,1,tx2,1,x3PNET);
	
	return 1;
}*/
//============================================================================================================
// Self Calibrating functions
/*#define ctl1	11
#define ctl2	10
#define IOA		1
#define IOB		2

int Selfcalibration_measure_isence(void)
{
	multiplexer_b_off();
	multiplexer_a_select(0);
	highside_off();
	ENTER
	spi1_muxmask(0); //disconnect the relays
	EXIT
	PD_1007_Sleep(100000); // 100ms settling time
	
	highside_set_dac(ctl1,250*53739); 
	return 0;
}

int Selfcalibration_measure_voltage(void)
{
	multiplexer_b_off();
	highside_off();
	ENTER
	spi1_muxmask(0); //disconnect the relays
	EXIT
	PD_1007_Sleep(100000); // 100ms settling time
	
	highside_set_dac(ctl2,0.250*53739);
	return 0;
}

int Selfcalibration_measure_current(void)
{
	multiplexer_b_off();
	
	ENTER
	spi1_muxmask(0); //disconnect the relays
	EXIT
	highside_off();
	return 0;
}

int Selfcalibration_PSU_on_io(int io)
{
	multiplexer_b_select_int(105);
	multiplexer_a_select_int(io);
	return 0;
}

int Selfcalibration_common_mode(void)
{
	int m1,m2;
	float tt = 0;
	unsigned i;
	
	multiplexer_b_off();

	for(i=0;i<10;i++)
	{
		spgen_set_dac(10000);
		PD_1007_Sleep(100000); // 100ms settling time
		m1=i_spgen_read(4);
		
		spgen_set_dac(50000);
		PD_1007_Sleep(100000); // 100ms settling time
		m2=i_spgen_read(4);
		
		tt += (m2-m1)/(50000.0-10000.0);
	}
	tt /= 10;
	//printk("test m1=%d,\tm2=%d,\tcc=%f\n",m1,m2,tt);
	
	return tt*1000000;
}

int route_spgen_to_current_in(void)
{
	multiplexer_a_select(0); // off
	multiplexer_b_select_spgen();
	return 0;
}

int Selfcalibration_measure_own_supply_voltage(void)
{
	multiplexer_b_off();
	highside_off();
	ENTER
	spi1_muxmask(0); //disconnect the relays
	EXIT
	PD_1007_Sleep(100000); // 100ms settling time
	
	highside_set_dac(ctl2,0.250*53739);
	multiplexer_b_select_int(102);
	multiplexer_a_select_int(2);
	return 0;
}
*/
